Clash Bot Workflow - plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Workflow Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

#### Prerequisites
```

terraform
module.create_team_step_function.data.aws_region.current[0]: Reading...
module.create_team_step_function.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.create_team_step_function.data.aws_caller_identity.current: Reading...
data.aws_acm_certificate.issued: Reading...
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
module.create_team_step_function.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
data.aws_acm_certificate.issued: Read complete after 1s [id=arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role.lambda_handler_exec will be created
  + resource "aws_iam_role" "lambda_handler_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clash_bot_lambda_event_handler_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.lambda_publisher_exec will be created
  + resource "aws_iam_role" "lambda_publisher_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clash_bot_lambda_event_publisher_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_handler_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_handler_exec_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "clash_bot_lambda_event_handler_exec_role"
    }

  # aws_iam_role_policy_attachment.lambda_publisher_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_publisher_exec_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "clash_bot_lambda_event_publisher_exec_role"
    }

  # aws_lambda_event_source_mapping.sqs_trigger will be created
  + resource "aws_lambda_event_source_mapping" "sqs_trigger" {
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = "clash-bot-event-handler"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # aws_lambda_function.event_handler_lambda will be created
  + resource "aws_lambda_function" "event_handler_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "clash-bot-event-handler"
      + handler                        = "handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + s3_key                         = "event-handler-85.tar.gz"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # aws_lambda_function.event_publisher_lambda will be created
  + resource "aws_lambda_function" "event_publisher_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "clash-bot-event-publisher"
      + handler                        = "handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + s3_key                         = "event-publisher-85.tar.gz"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.api_gateway.aws_apigatewayv2_api.this[0] will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "Clash Bot Workflow API Gateway for the development environment"
      + disable_execute_api_endpoint = false
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "clash-bot-workflow-development"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
        }

      + cors_configuration {
          + allow_headers = [
              + "authorization",
              + "content-type",
              + "x-amz-date",
              + "x-amz-security-token",
              + "x-amz-user-agent",
              + "x-api-key",
            ]
          + allow_methods = [
              + "*",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # module.api_gateway.aws_apigatewayv2_api_mapping.this[0] will be created
  + resource "aws_apigatewayv2_api_mapping" "this" {
      + api_id      = (known after apply)
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage       = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_domain_name.this[0] will be created
  + resource "aws_apigatewayv2_domain_name" "this" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "development.clash-bot.ninja"
      + id                               = (known after apply)
      + tags_all                         = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
        }

      + domain_name_configuration {
          + certificate_arn                        = "arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a"
          + endpoint_type                          = "REGIONAL"
          + hosted_zone_id                         = (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          + security_policy                        = "TLS_1_2"
          + target_domain_name                     = (known after apply)
        }
    }

  # module.api_gateway.aws_apigatewayv2_integration.this["$default"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "MOCK"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.this["$default"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_stage.default[0] will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
        }
    }

  # module.clash_bot_event_sqs.aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "clash-bot-event-sqs-development.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "service" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "dynamodbDynamodb"
        }
    }

  # module.create_team_step_function.aws_iam_policy.service["dynamodb"] will be created
  + resource "aws_iam_policy" "service" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "retrieve-teams-development-dynamodb"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
        }
    }

  # module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"] will be created
  + resource "aws_iam_policy_attachment" "service" {
      + id         = (known after apply)
      + name       = "retrieve-teams-development-dynamodb"
      + policy_arn = (known after apply)
      + roles      = [
          + "retrieve-teams-development",
        ]
    }

  # module.create_team_step_function.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.us-east-1.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "retrieve-teams-development"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
        }
      + unique_id             = (known after apply)
    }

  # module.create_team_step_function.aws_sfn_state_machine.this[0] will be created
  + resource "aws_sfn_state_machine" "this" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = <<-EOT
            {
                "Comment": "A Hello World example of the Amazon States Language using Pass states",
                "StartAt": "Hello",
                "States": {
                  "Hello": {
                    "Type": "Pass",
                    "Result": "Hello",
                    "Next": "World"
                  },
                  "World": {
                    "Type": "Pass",
                    "Result": "World",
                    "End": true
                  }
                }
              }
        EOT
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "retrieve-teams-development"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Name" = "retrieve-teams-development"
        }
      + tags_all                  = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
          + "Name"        = "retrieve-teams-development"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + timeouts {}
    }

  # module.dynamodb_table.aws_dynamodb_table.this[0] will be created
  + resource "aws_dynamodb_table" "this" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "type"
      + id               = (known after apply)
      + name             = "clash-bot-workflow-development"
      + range_key        = "id"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "clash-bot-workflow-development"
        }
      + tags_all         = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
          + "Name"        = "clash-bot-workflow-development"
        }
      + write_capacity   = 5

      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "type"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = false
          + kms_key_arn = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "60m"
        }

      + ttl {
          + enabled = false
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*